// Одой из ключевых задач JavaScript является взаимодействие с пользователем и манипуляция элементами веб - страницы. 
// Для JavaScript веб - страница доступна в виде объектной модели документа(document object model) или сокращенно DOM. |
//     DOM описывает структуру веб - станицы в виде древовидного представления и 
// предоставляет разработчикам способ получить доступ к отдельным элементам веб - станицы.

// Все компоненты упорядочены в DOM иерархическим образом, где каждый компонент представляет отдельный узел. 
// То есть каждый элемент, например, элемент div, представляет собой узел. 
// Но также и текст внутри элемента представляет отдельный узел.